### Project 2 first Kaggle submission

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [2]:
train = pd.read_csv('datasets//train.csv')
test = pd.read_csv('datasets//test.csv')
sample = pd.read_csv('datasets//sample_sub_reg.csv')

In [3]:
train.shape, test.shape, sample.shape

((2051, 81), (878, 80), (878, 2))

In [4]:
sample.head(2)

   Id    SalePrice
0   2  181479.1217
1   4  181479.1217

In [5]:
# train model on train
# test model on test
train.columns
X_train = train[['1st Flr SF']]
y_train = train.SalePrice
X_test = test[['1st Flr SF']]

slr_kaggle = LinearRegression()

#fit on train df
slr_kaggle.fit(X_train, y_train)
# predict on test df
y_test_hat = slr_kaggle.predict(X_test)

In [6]:
# create df to upload to kaggle
# this df has to have ID and SalePrice columns, spelled exactly this way
print(test.shape, sample.shape)
kaggle_submission = pd.DataFrame({'Id': test['Id'],
                                  'SalePrice': y_test_hat})
kaggle_submission.head(3)

(878, 80) (878, 2)

     Id      SalePrice
0  2658  149755.134628
1  2718  280699.737426
2  2414  119584.706788

In [7]:
kaggle_submission.to_csv('datasets/slr_to_kaggle.csv',
                        index=False)

In [8]:
pd.read_csv('datasets/slr_to_kaggle.csv')

       Id      SalePrice
0    2658  149755.134628
1    2718  280699.737426
2    2414  119584.706788
3    1989  157174.092294
4     625  209848.691719
..    ...            ...
873  1662  171517.410447
874  1234  173990.396336
875  1373  187220.870839
876  1672  144314.565673
877  1939  151857.172633

[878 rows x 2 columns]

In [9]:
train.head(1)

,Id,PID,MS SubClass,MS Zoning,Lot Frontage,Lot Area,Street,Alley,Lot Shape,Land Contour,...,Screen Porch,Pool Area,Pool QC,Fence,Misc Feature,Misc Val,Mo Sold,Yr Sold,Sale Type,SalePrice
0,109,533352170,60,RL,NaN,13517,Pave,NaN,IR1,Lvl,...,0,0,NaN,NaN,NaN,0,3,2010,WD,130500

In [10]:
train.shape

(2051, 81)

In [11]:
train['baseline'] = train['SalePrice'].mean()

In [12]:
train.drop(train.columns[0:4], axis=1, inplace=True)
train.drop(train.columns[2:12], axis=1, inplace=True)
train.drop(train.columns[3:33], axis=1, inplace=True)
train.drop(train.columns[4:6], axis=1, inplace=True)
train.drop(train.columns[6:34], axis=1, inplace=True)

In [13]:
train = train.loc[train['Bldg Type'] == '1Fam']

In [14]:
train.shape

(1700, 8)

In [15]:
train.isnull().sum()

Lot Frontage    285
Lot Area          0
Bldg Type         0
Gr Liv Area       0
Full Bath         0
Half Bath         0
SalePrice         0
baseline          0
dtype: int64

In [16]:
train.dtypes

Lot Frontage    float64
Lot Area          int64
Bldg Type        object
Gr Liv Area       int64
Full Bath         int64
Half Bath         int64
SalePrice         int64
baseline        float64
dtype: object

In [17]:
train['Lot Frontage'].unique()

array([ nan,  43.,  68.,  73.,  82., 137.,  70.,  64., 120.,  74.,  93.,
        34.,  80.,  71.,  72., 109., 103.,  92.,  65.,  60.,  79., 105.,
        75., 107.,  81., 100.,  63.,  94.,  44.,  50.,  35.,  67.,  88.,
        83.,  53.,  58.,  57.,  52.,  87., 134.,  56.,  54., 140.,  78.,
        85.,  90.,  96.,  62.,  49.,  59., 155.,  61.,  86., 128.,  77.,
        42.,  89.,  51.,  69.,  55., 112.,  76.,  48., 125.,  98., 113.,
       102.,  40., 122.,  91.,  84., 119., 118.,  66.,  95., 108.,  41.,
       106., 110.,  30., 130.,  97.,  45., 123., 129., 115.,  47., 114.,
       104.,  39.,  46., 121., 124., 313., 141., 101.,  99., 160., 174.,
       144.,  37., 138.,  38., 111., 200., 150., 117., 153., 116.])

In [18]:
train['Lot Area'].unique()

array([13517, 11492,  7922, ..., 12444, 11449,  7558], dtype=int64)

In [19]:
train

,Lot Frontage,Lot Area,Bldg Type,Gr Liv Area,Full Bath,Half Bath,SalePrice,baseline
0,NaN,13517,1Fam,1479,2,1,130500,181469.701609
1,43.0,11492,1Fam,2122,2,1,220000,181469.701609
2,68.0,7922,1Fam,1057,1,0,109000,181469.701609
3,73.0,9802,1Fam,1444,2,1,174000,181469.701609
4,82.0,14235,1Fam,1445,2,0,138500,181469.701609
...,...,...,...,...,...,...,...,...
2046,79.0,11449,1Fam,1728,2,0,298751,181469.701609
2047,NaN,12342,1Fam,861,1,0,82500,181469.701609
2048,57.0,7558,1Fam,1913,1,1,177000,181469.701609
2049,80.0,10400,1Fam,1200,1,0,144000,181469.701609
2050,60.0,7500,1Fam,1804,2,1,189000,181469.701609